## Product Data Science - Data Analytics - Test
#### VÃ­tor Moura - Data Scientist

In [2]:
# Imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [9]:
# Load data
df_unique = pd.read_csv('desafio-ds/individuos_espec.csv', sep = ';')
df_connections = pd.read_csv('desafio-ds/conexoes_espec.csv', sep=';')

In [13]:
df_unique.tail(10)

,name,idade,estado_civil,qt_filhos,estuda,trabalha,pratica_esportes,transporte_mais_utilizado,IMC
999990,999991,21.0,divorciado,1.0,1.0,1.0,0.0,publico,23.120396
999991,999992,18.0,divorciado,2.0,1.0,1.0,1.0,publico,NaN
999992,999993,66.0,divorciado,1.0,0.0,1.0,1.0,particular,19.363203
999993,999994,32.0,casado,0.0,0.0,1.0,0.0,particular,NaN
999994,999995,33.0,casado,0.0,0.0,0.0,NaN,particular,16.982246
999995,999996,34.0,casado,1.0,0.0,1.0,1.0,publico,17.556771
999996,999997,40.0,casado,1.0,0.0,1.0,1.0,particular,24.848402
999997,999998,30.0,divorciado,1.0,0.0,0.0,1.0,publico,NaN
999998,999999,33.0,casado,0.0,1.0,1.0,1.0,publico,16.979569
999999,1000000,22.0,solteiro,0.0,0.0,0.0,0.0,NaN,24.018825

In [12]:
df_unique.isna().sum()

name                              0
idade                         95937
estado_civil                  50073
qt_filhos                     28867
estuda                        40130
trabalha                       6353
pratica_esportes             149124
transporte_mais_utilizado     43033
IMC                          113870
dtype: int64

In [15]:
df_connections.tail(10)

            V1       V2      grau       proximidade  prob_V1_V2
999989  499995   999991  trabalho     visita_casual         NaN
999990  499996   999992    amigos       visita_rara         NaN
999991  499996   999993  trabalho     visita_casual    0.621816
999992  499997   999994  trabalho  visita_frequente         NaN
999993  499997   999995   familia     visita_casual         NaN
999994  499998   999996  trabalho       visita_rara         NaN
999995  499998   999997  trabalho       visita_rara         NaN
999996  499999   999998   familia     visita_casual    0.451662
999997  499999   999999   familia       visita_rara    0.186973
999998  500000  1000000   familia       visita_rara         NaN

In [14]:
df_connections.isna().sum()

V1                  0
V2                  0
grau                0
proximidade         0
prob_V1_V2     500000
dtype: int64